app/views/home/index.html.erb

SELECT "posts".* FROM "posts"
---

<% Post.all.each do |post| %>