app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "456457"], ["description", "ttttttt"], ["created_at", "2023-07-21 23:44:32.090987"], ["updated_at", "2023-07-21 23:44:32.090987"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "description" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["description", "gasgasgasgsa fafsafsa"], ["updated_at", "2023-07-21 23:45:54.622101"], ["id", 6]]
---
  def update

        respond_to do |format|
          if @post.update(post_params)